<?php get_header(); ?>
<!-- main and sidebar -->
<?php get_sidebar(); ?>
  <main class="col-md-10 bg-content">

    <h1>Конспект Laravel</h1>
    <span>(Learn to Build Web Apps using Laravel Framework)</span>
    <h2>003 App  DB Setup - Implementation</h2>
 
    Создаем миграцию
    Создаем поля для базы
      <p></p>
      <p></p>
      <p></p>
      <p></p>
      <p></p>
      <p></p>
      <p></p>
      <p></p>
      <p></p>
      <h2>Алгоритм действий</h2>
      <p>делаю с нуля новый блок с комментариями</p>
      <p></p>
      <p>Сначало сделал ресурсный контроллер, создал миграцию</p>
      <p>Добавлю в базу тестовый комент и попытаюсь вывести во вьюхе</p>
      <p>вьюху тоже создам, соответственно пропишу уонтроллер ресурс - для коментов</p>
      <p>создаем модель</p>
      <p></p>
      <p>создаю добавления комента, нужен комманд</p>
      <p></p>
      <p></p>
      <p></p>
      <p></p>
      <p></p>
      <p></p>
      <p></p>
      <p></p>
      <p></p>
      <p></p>
      <p></p>
      <p></p>
      <p></p>
      <p></p>


  </main>
</div>
<?php get_footer(); ?>






